# Taps
tap "databricks/tap"
tap "tw93/tap"

# === Shell / Core CLI ===
brew "bat"
brew "coreutils"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gron"
brew "jq"
brew "ripgrep"
brew "safe-rm"
brew "sd"
brew "stow"
brew "yq"
brew "zoxide"

# === Git / Development ===
brew "ast-grep"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "just"
brew "shellcheck"

# === Terminal UI / File Management ===
brew "btop"
brew "lazygit"
brew "neovim"
brew "yazi"

# === Languages / Runtime ===
brew "cmake"
brew "cmake-docs"
brew "go"
brew "jenv"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "python@3.11"
brew "uv"
brew "yarn"

# === Network / Cloud ===
brew "awscli"
brew "azure-cli"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "wget"
brew "wireguard-tools"

# === AI ===
brew "gemini-cli"
brew "ollama"

# === Data Processing ===
brew "avro-tools"
brew "databricks/tap/databricks"
brew "librdkafka"
brew "protobuf"

# === Other ===
brew "cbonsai"
brew "fastfetch"
brew "ffmpeg"
brew "genact"
brew "gost"
brew "katago"
brew "lc0"
brew "libssh"
brew "openblas"
brew "sevenzip"
brew "stockfish"
brew "tealdeer"
brew "tw93/tap/mole"
brew "typst"
brew "unar"
brew "yt-dlp"

# === Cask: Terminal / Editor ===
cask "ghostty"
cask "jetbrains-toolbox"
cask "markedit"
cask "visual-studio-code"
cask "wezterm"
cask "zed"

# === Cask: System Tools ===
cask "aerospace"
cask "appcleaner"
cask "clipy"
cask "deskpad"
cask "finetune"
cask "flashspace"
cask "input-source-pro"
cask "ipatool"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kaset"
cask "orbstack"
cask "raycast"

# === Cask: Productivity / Other ===
cask "boop"
cask "bruno"
cask "dbeaver-community"
cask "drawio"
cask "figma"
cask "lm-studio"
cask "logseq"
cask "osaurus"
cask "pronotes"
cask "reminders-menubar"
cask "sabaki"
cask "slack"
cask "spotify"
cask "squirrel-app"
cask "zen"

# === Cask: Fonts ===
cask "font-cascadia-code"
cask "font-fira-code-nerd-font"
cask "font-google-sans-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono-nerd-font"
